gap> O := Origami((2,3,4)(5,6,8)(9,10,12), (1,2)(3,5,7)(6,9,11));
Origami((2,3,4)(5,6,8)(9,10,12), (1,2)(3,5,7)(6,9,11), 12)
gap> Genus(O);
6
gap> DessinOfOrigami(O);
[ Dessin((2,4,3)(5,8,6)(9,12,10), (1,5,4)(7,9,8)(10,12,11), 12) ]
gap> D := last[1];
Dessin((2,4,3)(5,8,6)(9,12,10), (1,5,4)(7,9,8)(10,12,11), 12)
gap> IsConnectedDessin(D);
true
gap> ConnectedComponentsDessin(D);
[ Dessin((2,4,3)(5,8,6)(9,12,10), (1,5,4)(7,9,8)(10,12,11), 12) ]
gap> O := Origami((1,2)(3,4), (2,3));
Origami((1,2)(3,4), (2,3), 4)
gap> OrigamiGraph(O);
[ [ 0 ], [ [ 2 ] ] ]
gap> D := Dessin((1,2,3), (2,3), 3);
Dessin((1,2,3), (2,3), 3)
gap> ValencyList(D);
rec( black := [ 3 ], white := [ 1, 2 ] )
gap> x := (1,2,5,6,9,10)(3,4)(7,8)(11,12);
(1,2,5,6,9,10)(3,4)(7,8)(11,12)
gap> y := (1,3,5,7,9,11)(2,4,10,12,6,8);
(1,3,5,7,9,11)(2,4,10,12,6,8)
gap> O := Origami(x, y);
Origami((1,2,5,6,9,10)(3,4)(7,8)(11,12), (1,3,5,7,9,11)(2,4,10,12,6,8), 12)
gap> OrigamiGraph(O);
[ [ 1, 0 ], [ [ 0, 3 ], [ 1, 0 ] ] ]
gap> O := Origami((3,4), (1,2,3,5,4));
Origami((3,4), (1,2,3,5,4), 5)
gap> OrigamiGraph(O);
[ [ 0, 0, 0 ], [ [ 0, 0, 1 ], [ 1, 0, 0 ], [ 1, 1, 0 ] ] ]
gap> O := Origami((6,7), (1,2,3,4,5,6));
Origami((6,7), (1,2,3,4,5,6), 7)
gap> OrigamiGraph(O);
[ [ 0, 0, 0, 0, 0 ], 
  [ [ 1, 0, 0, 0, 1 ], [ 1, 0, 0, 0, 0 ], [ 0, 1, 0, 0, 0 ], 
      [ 0, 0, 1, 0, 0 ], [ 0, 0, 0, 1, 0 ] ] ]
gap> O := Origami((2,3), (1,2)(3,4,5));
Origami((2,3), (1,2)(3,4,5), 5)
gap> OrigamiGraph(O);
[ [ 0, 0, 0 ], [ [ 0, 1, 0 ], [ 1, 0, 1 ], [ 1, 0, 0 ] ] ]
gap> O := Origami((1,2,3,4,5,6), (1,6,5,4,3,2));
Origami((1,2,3,4,5,6), (1,6,5,4,3,2), 6)
gap> AllDessinsOfOrigami(O);
[ [ Dessin((1,3,5,6,4,2), (1,2,4,6,5,3), 6) ], [ Dessin((1,6,5,3,4,2), (1,2,4,3,5,6), 6) ], 
  [ Dessin((1,3,2), (1,2,3), 3), Dessin((1,3,2), (1,2,3), 3) ],
  [ Dessin((1,3,2), (1,2,3), 3), Dessin((1,3,2), (1,2,3), 3) ] ]