gap> HowManySubgroups(5, 0);
[ 1, 0, 0, 0, 0 ]
gap> HowManySubgroups(5, 1);
[ 1, 1, 1, 1, 1 ]
gap> HowManyEpi(0, 1);
1
gap> HowManyEpi(0, 2);
0
gap> HowManyEpi(1, 3);
2
gap> HowManyEpi(1, 6);
2
gap> HowManyEpi(1, 7);
6
gap> HowManyEpi(3, 5);
124
gap> HowManyEpi(4, 3);
80
gap> HowManyConjugatedSubgroups(1, 2);
1
gap> HowManyConjugatedSubgroups(3, 2);
7
gap> HowManyConjugatedSubgroups(5, 2);
97
gap> HowManyConjugatedSubgroups(7, 2);
4163
