gap> START_TEST( "veechgroup test" );
gap> O := Origami((1,2,3), (2,3), 3);
Origami((1,2,3), (2,3), 3)
gap> SAction(VeechGroup( O ));       
(1,2)
gap> TAction( VeechGroup( O ));
(2,3)
gap> Cosets( O );
[ <identity ...>, S, S*T ]
gap> O := Origami((1,2,4,3), (2,4), 4);
Origami((1,2,4,3), (2,4), 4)
gap> SAction(VeechGroup( O ));
(1,3)(2,5)(6,8)(7,9)
gap> TAction( VeechGroup( O ));
(1,2,4,7)(3,6)(5,8,9)
gap> Cosets( O );
[ <identity ...>, T, S, T^2, T*S, S*T, T^3, T*S*T, T^3*S ]
gap> O := Origami((1,4,3,5,2), (1,4,3,5,2), 5);
Origami((1,4,3,5,2), (1,4,3,5,2), 5)
gap> SAction(VeechGroup( O )); 
(1,3)(2,4)
gap> TAction( VeechGroup( O ));
(1,2,3,5,6)
gap> Cosets( O );                              
[ <identity ...>, T, S, T*S, S*T, S*T^2 ]
gap> O := Origami((1,4,2,3,5,6), (1,3,6)(2,4), 6);
Origami((1,4,2,3,5,6), (1,3,6)(2,4), 6)
gap> SAction(VeechGroup( O ));
(1,3,7,14)(2,5,11,20)(4,9,18,29)(6,13,24,35)(8,16,28,40)(10,19,30,17)(12,22,32,43)(15,26,37,49)(21,27,39,52)(23,34,46,25)(31,42,55,67)(33,45,57,70)(36,48,60,75)(38,51,62,78)(41,54,66,
83)(44,56,69,65)(47,59,74,87)(50,61,77,73)(53,64,81,93)(58,72,86,91)(63,79,90,76)(68,71,82,94)(80,92,96,84)(85,89,95,88)
gap> TAction( VeechGroup( O ));
(1,2,4,8,15,25)(3,6,12,21,29,19)(5,10)(7,11,18,28,37,34)(9,17,14,24,32,39)(13,23,33,44,42)(16,27,38,50,48)(20,30)(22,31,41,53,63,51)(26,36,47,58,71,45)(35,46,57,69,67)(40,52,62,77,75)(43,
55,66,81,90,78)(49,60,74,86,94,70)(54,65,82,92)(56,68,84,83)(59,73,79,89)(61,76,88,87)(64,80,91,95)(72,85,93,96)
gap> Cosets( O );
[ <identity ...>, T, S, T^2, T*S, S*T, S^2, T^3, T^2*S, T*S*T, T*S^2, S*T^2, S*T*S, S^3, T^4, T^3*S, T^2*S*T, T^2*S^2, (T*S)^2, T*S^3, S*T^3, S*T^2*S, (S*T)^2, S*T*S^2, T^5, T^4*S, 
  T^3*S*T, T^3*S^2, T^2*S^3, (T*S)^2*S, S*T^2*S*T, S*T^2*S^2, (S*T)^2*T, (S*T)^2*S, S*T*S^3, T^4*S*T, T^4*S^2, T^3*S*T^2, T^2*(T*S)^2, T^3*S^3, (S*T^2)^2, S*T*(T*S)^2, S*T^2*S^3, 
  (S*T)^2*T^2, (S*T)^2*T*S, (S*T)^2*S^2, T^4*S*T^2, T^3*(T*S)^2, T^4*S^3, T^3*S*T^3, T*(T^2*S)^2, T^2*(T*S)^2*S, (S*T^2)^2*T, (S*T^2)^2*S, S*T*(T*S)^2*S, (S*T)^2*T^2*S, (S*T)^2*T*S^2, 
  T^4*S*T^3, T^2*(T^2*S)^2, T^3*(T*S)^2*S, (T^3*S)^2, T*(T^2*S)^2*S, (S*T^2)^2*T^2, (S*T^2)^2*T*S, (S*T^2)^2*S*T, (S*T^2)^2*S^2, S*T*(T*S)^2*S^2, (S*T)^2*T^2*S*T, (S*T)^2*T^2*S^2, 
  (S*T)^2*T*S^3, T^4*S*T^4, T*(T^3*S)^2, T^2*(T^2*S)^2*T, T^2*(T^2*S)^2*S, T^3*(T*S)^2*S^2, (T^3*S)^2*T, (T^3*S)^2*S, T*(T^2*S)^2*S^2, (S*T^2)^2*T^2*S, S*(T^2*S*T)^2, (S*T^2)^2*T*S^2, 
  (S*T^2)^3, (S*T^2)^2*S^3, S*(T*S*T^2)^2, T*(T^3*S)^2*T, T*(T^3*S)^2*S, T^2*(T^2*S)^2*S^2, (T^3*S)^2*T^2, (S*T^2)^2*T^2*S*T, (S*T^2)^2*T^2*S^2, S*(T^2*S*T)^2*T, S*(T^2*S*T)^2*S, 
  (S*T^2)^2*T*S^3, (S*T^2)^3*S, (S*T^2)^2*T^2*S*T*S, S*(T^2*S*T)^2*S^2 ]
gap> O := Origami((1,7,3)(2,6,4), (2,7,3,5), 7);  
Origami((1,7,3)(2,6,4), (2,7,3,5), 7)
gap> SAction(VeechGroup( O ));
(1,3,7,13)(2,5,10,18)(4,8,15,23)(6,12,20,29)(9,17,26,37)(11,19,28,35)(14,22,32,44)(16,25,36,49)(21,31,43,57)(24,34,47,62)(27,39,48,64)(30,41,55,74)(33,45,59,42)(38,51,63,82)(40,53,71,
93)(46,61,80,83)(50,66,81,101)(52,69,90,112)(54,73,96,76)(56,75,58,77)(60,79,99,123)(65,84,100,124)(67,87,102,127)(68,88,109,134)(70,92,115,143)(72,95,118,147)(78,98,122,154)(85,105,125,
157)(86,107,126,159)(89,111,139,174)(91,114,142,178)(94,117,146,183)(97,120,151,190)(103,129,155,195)(104,131,156,197)(106,133,158,199)(108,136,167,210)(110,138,173,218)(113,140,176,
172)(116,144,180,141)(119,149,187,233)(121,153,193,240)(128,161,194,242)(130,163,196,244)(132,165,198,164)(135,169,209,261)(137,171,216,270)(145,182,226,281)(148,185,230,287)(150,189,236,
295)( [...] )
gap> TAction( VeechGroup( O ));
(1,2,4)(3,6,11,17)(5,9,16,24,33,22)(7,10,15)(8,14,21,30,40,52,68,87,39,12)(13,20,28,37)(18,26,36,47,59,44)(19,27,38,50,65,83,49)(23,32,43,55,71,90,109,127,64,29)(25,35,48,63,81,100,
61)(31,42,56,73)(34,46,60,78,97,119,148,184,227,182,95,77)(41,54,72,94,116,92)(45,58,76,57)(51,67,86,106,132,105)(53,70,91,113,111)(62,80,99,122,151,187,230,284,342,281,147,75)(66,85,104,
130,162,202,249,308,376,451,248,129)(69,89,110,137,170,136)(74,96,118,146,180,143)(79,84,103,128,160,153)(82,102,126,158,198,157)(88,108,135,168,211,262,159)(93,115,142,176,174)(98,121,
152,191,189)(101,125,156,196,243,301,366,441,528,619,365,195)(107,134,167,209,260,321,208)(112,139,173,216,267,210)(114,141,177,221,275,220)(117,145,181,224)(120,150,188,234,291,354,428,
517,426,232)( [...] )
gap> Cosets( O );
[ <identity ...>, T, S, T^2, T*S, S*T, S^2, T^2*S, T*S*T, T*S^2, S*T^2, S*T*S, S^3, T^2*S*T, T^2*S^2, T*S*T^2, (T*S)^2, T*S^3, S*T^2*S, S*T*S^2, T^2*S*T^2, T*(T*S)^2, T^2*S^3, T*S*T^3, 
  T*S*T^2*S, (T*S)^2*S, S*T^2*S*T, S*T^2*S^2, S*T*S^3, T^2*S*T^3, (T^2*S)^2, T*(T*S)^2*S, T*S*T^4, T*S*T^3*S, (T*S*T)^2, T*S*T^2*S^2, (T*S)^2*S^2, (S*T^2)^2, S*T*(T*S)^2, T^2*S*T^4, 
  T^2*S*T^3*S, (T^2*S)^2*T, (T^2*S)^2*S, T*(T*S)^2*S^2, T*S*T^4*S, T*S*T^3*S*T, T*S*T^3*S^2, (T*S*T)^2*T, T*S*T^2*S^3, (S*T^2)^2*T, (S*T^2)^2*S, T^2*S*T^5, T^2*S*T^4*S, (T^2*S*T)^2, 
  T^2*S*T^3*S^2, (T^2*S)^2*T^2, (T^2*S)^2*S^2, T*S*T^4*S*T, T*S*T^4*S^2, (T*S*T^2)^2, T*S*T^2*(T*S)^2, T*S*T^3*S^3, (T*S*T)^2*T^2, (T*S*T)^2*T*S, (S*T^2)^2*T^2, (S*T^2)^2*T*S, 
  (S*T^2)^2*S*T, T^2*S*T^6, T^2*S*T^5*S, T^2*S*T^4*S*T, T^2*S*T^4*S^2, (T^2*S*T)^2*T, (T^2*S*T)^2*S, T^2*S*T^3*S^3, (T^2*S)^3, T*S*T^4*S*T^2, T*S*T^3*(T*S)^2, (T*S*T^2)^2*T, 
  (T*S*T^2)^2*S, T*S*T^2*(T*S)^2*S, (T*S*T)^2*T^3, (T*S*T)^2*T^2*S, (S*T^2)^2*T^3, (S*T^2)^2*T^2*S, S*(T^2*S*T)^2, (S*T^2)^3, (S*T^2)^2*S*T*S, T^2*S*T^6*S, T^2*S*T^5*S*T, T^2*S*T^5*S^2, 
  (T^2*S*T^2)^2, T^2*S*T^3*(T*S)^2, T^2*S*T^4*S^3, (T^2*S*T)^2*T^2, (T^2*S*T)^2*T*S, (T^2*S*T)^2*S^2, (T*S*T^2)^2*T^2, (T*S*T^2)^2*T*S, (T*S*T^2)^2*S^2, (T*S*T)^2*T^4, (T*S*T)^2*T^3*S, 
  T*S*(T^2*S*T)^2, (S*T^2)^2*T^2*S*T, S*(T^2*S*T)^2*T, S*(T^2*S*T)^2*S, (S*T^2)^3*T, (S*T^2)^3*S, T^2*S*T^6*S*T, T^2*S*T^6*S^2, T^2*S*T^5*S*T^2, T^2*S*T^4*(T*S)^2, T^2*S*T^5*S^3, 
  (T^2*S*T^2)^2*T, (T^2*S*T^2)^2*S, T^2*S*T^3*(T*S)^2*S, (T^2*S*T)^2*T^3, (T^2*S*T)^2*T^2*S, (T^2*S*T)^2*T*S^2, (T*S*T^2)^2*T^3, (T*S*T^2)^2*T^2*S, (T*S*T^2)^2*T*S*T, (T*S*T^2)^2*T*S^2, 
  (T*S*T^2)^2*S^3, (T*S*T)^2*T^4*S, (T*S*T)^2*T^3*S*T, T*S*(T^2*S*T)^2*T, T*S*(T^2*S*T)^2*S, S*(T^2*S*T^2)^2, (S*T^2)^2*T^2*S*T*S, S*(T^2*S*T)^2*T^2, S*(T^2*S*T)^2*T*S, (S*T^2)^3*T^2, 
  (S*T^2)^3*T*S, (S*T^2)^3*S*T, T^2*S*T^6*S*T^2, T^2*S*T^5*(T*S)^2, (T^2*S*T^3)^2, T^2*S*T^3*(T^2*S)^2, T^2*S*T^4*(T*S)^2*S, (T^2*S*T^2)^2*T*S, (T^2*S*T^2)^2*S*T, (T^2*S*T^2)^2*S^2, 
  T^2*S*T^3*(T*S)^2*S^2, (T^2*S*T)^2*T^3*S, (T^2*S*T)^3, (T^2*S*T)^2*T^2*S^2, (T^2*S*T)^2*T*S^3, (T*S*T^2)^2*T^4, (T*S*T^2)^2*T^3*S, T*S*(T^3*S*T)^2, (T*S*T^2)^2*T^2*S^2, (T*S*T^2)^3, 
  (T*S*T^2)^2*T*S*T*S, (T*S*T^2)^2*T*S^3, (T*S*T)^2*T^4*S*T, T*S*(T^2*S*T^2)^2, (T*S*T)^2*T^2*(T*S)^2, T*S*(T^2*S*T)^2*T^2, T*S*(T^2*S*T)^2*T*S, S*(T^2*S*T^2)^2*T, S*(T^2*S*T^2)^2*S, 
  S*(T^2*S*T)^2*T^3, S*(T^2*S*T)^2*T^2*S, S*(T^2*S*T)^2*T*S*T, (S*T^2)^3*T^2*S, S*T^2*S*(T^2*S*T)^2, (S*T^2)^4, T^2*S*T^6*S*T^3, T^2*S*T^4*(T^2*S)^2, (T^2*S*T^3)^2*T, (T^2*S*T^3)^2*S, 
  T^2*S*T^3*(T^2*S)^2*T, T^2*S*T^3*(T^2*S)^2*S, T^2*S*T^4*(T*S)^2*S^2, (T^2*S*T^2)^2*T*S*T, (T^2*S*T^2)^2*T*S^2, (T^2*S*T^2)^2*S*T^2, (T^2*S*T^2)^2*S^3, T^2*S*(T^3*S*T)^2, 
  (T^2*S*T)^2*T^3*S^2, (T^2*S*T)^3*T, (T^2*S*T)^3*S, (T^2*S*T)^2*T^2*S^3, (T*S*T^2)^2*T^5, (T*S*T^2)^2*T^4*S, (T*S*T^2)^2*T^3*S*T, (T*S*T^2)^2*T^3*S^2, T*S*(T^3*S*T)^2*T, 
  T*S*(T^3*S*T)^2*S, (T*S*T^2)^2*T^2*S^3, (T*S*T^2)^3*T, (T*S*T^2)^3*S, (T*S*T^2)^2*T*S*T*S^2, (T*S*T)^2*T^4*S*T^2, (T*S*T)^2*T^3*(T*S)^2, T*S*(T^2*S*T^2)^2*T, T*S*(T^2*S*T^2)^2*S, 
  T*S*(T^2*S*T)^2*T^3, T*S*(T^2*S*T)^2*T^2*S, S*(T^2*S*T^2)^2*T*S, S*(T^2*S*T^2)^2*S*T, S*(T^2*S*T)^2*T^4, S*(T^2*S*T)^2*T^3*S, S*(T^2*S*T)^3, S*(T^2*S*T)^2*T*S*T^2, (S*T^2)^3*T^2*S*T, 
  S*T^2*S*(T^2*S*T)^2*T, S*T^2*S*(T^2*S*T)^2*S, (S*T^2)^4*T, (S*T^2)^4*S, (T^2*S*T^4)^2, T^2*S*T^3*(T^3*S)^2, T^2*S*T^4*(T^2*S)^2*T, (T^2*S*T^3)^2*T*S, (T^2*S*T^3)^2*S*T, 
  (T^2*S*T^3)^2*S^2, T^2*S*T^3*(T^2*S)^2*T^2, T^2*S*T^3*(T^2*S)^2*S^2, (T^2*S*T^2)^2*T*S*T^2, (T^2*S*T^2)^2*T*S*T*S, (T^2*S*T^2)^2*S*T^3, (T^2*S*T^2)^2*S*T^2*S, T^2*S*(T^3*S*T)^2*T, 
  T^2*S*(T^3*S*T)^2*S, (T^2*S*T)^3*T*S, (T^2*S*T)^3*S^2, (T*S*T^2)^2*T^6, (T*S*T^2)^2*T^5*S, (T*S*T^2)^2*T^4*S*T, (T*S*T^2)^2*T^4*S^2, T*S*(T^3*S*T^2)^2, (T*S*T^2)^2*T^2*(T*S)^2, 
  (T*S*T^2)^2*T^3*S^3, T*S*(T^3*S*T)^2*T^2, T*S*(T^3*S*T)^2*T*S, T*S*(T^3*S*T)^2*S^2, (T*S*T^2)^3*T*S, (T*S*T^2)^3*S*T, (T*S*T^2)^3*S^2, (T*S*T^2)^2*(T*S)^2*S^2, T*S*(T^2*S*T^3)^2, 
  (T*S*T)^2*T^2*(T^2*S)^2, T*S*(T^2*S*T^2)^2*T^2, T*S*(T^2*S*T^2)^2*T*S, T*S*(T^2*S*T)^3, S*(T^2*S*T^2)^2*T*S*T, S*(T^2*S*T^2)^2*S*T^2, S*(T^2*S*T^2)^2*S*T*S, S*(T^2*S*T)^2*T^5, 
  S*(T^2*S*T)^2*T^4*S, S*T^2*S*(T^3*S*T)^2, S*(T^2*S*T)^3*T, S*(T^2*S*T)^3*S, ((S*T^2)^2*T)^2, S*(T^2*S*T)^2*T*S*T^2*S, S*T^2*S*(T^2*S*T^2)^2, (S*T^2)^3*T^2*S*T*S, 
  S*T^2*S*(T^2*S*T)^2*T^2, S*T^2*S*(T^2*S*T)^2*T*S, (S*T^2)^4*T^2, (S*T^2)^4*T*S, (T^2*S*T^4)^2*T, (T^2*S*T^4)^2*S, T^2*S*T^3*(T^3*S)^2*T, T^2*S*T^4*(T^2*S)^2*T^2, (T^2*S*T^3)^2*T*S*T, 
  (T^2*S*T^3)^2*T*S^2, (T^2*S*T^3)^2*S*T^2, (T^2*S*T^3)^2*S*T*S, (T^2*S*T^3)^2*S^3, T^2*S*T^3*(T^2*S)^2*T^3, T^2*S*T^3*(T^2*S)^3, (T^2*S*T^2)^2*T*S*T^3, (T^2*S*T^2)^2*T*S*T^2*S, 
  (T^2*S*T^2)^2*S*T^4, (T^2*S*T^2)^2*S*T^3*S, T^2*S*(T^3*S*T)^2*T^2, T^2*S*(T^3*S*T)^2*T*S, (T^2*S*T)^3*T*S*T, (T^2*S*T)^3*T*S^2, (T^2*S*T)^3*S^3, (T*S*T^2)^2*T^6*S, (T*S*T^2)^2*T^5*S*T, 
  (T*S*T^2)^2*T^5*S^2, (T*S*T^2)^2*T^4*S*T^2, (T*S*T^2)^2*T^3*(T*S)^2, (T*S*T^2)^2*T^4*S^3, T*S*(T^3*S*T^2)^2*T, T*S*(T^3*S*T^2)^2*S, (T*S*T^2)^2*T^2*(T*S)^2*S, T*S*(T^3*S*T)^2*T^3, 
  T*S*(T^3*S*T)^2*T^2*S, T*S*(T^3*S*T)^2*T*S*T, T*S*(T^3*S*T)^2*T*S^2, T*S*(T^3*S*T)^2*S^3, (T*S*T^2)^3*T*S*T, (T*S*T^2)^3*T*S^2, (T*S*T^2)^3*S*T^2, (T*S*T^2)^3*S^3, 
  (T*S*T)^2*T^2*(T^2*S)^2*T, T*S*(T^2*S*T^2)^2*T^3, T*S*(T^2*S*T^2)^2*T^2*S, T*S*(T^2*S*T^2)^2*T*S*T, T*S*(T^2*S*T)^3*T, S*(T^2*S*T^2)^2*T*S*T^2, S*(T^2*S*T^2)^2*T*S*T*S, 
  S*(T^2*S*T^2)^2*S*T^2*S, S*(T^2*S*T)^2*T^6, S*(T^2*S*T)^2*T^5*S, S*(T^2*S*T)^2*T^4*S*T, S*T^2*S*(T^3*S*T)^2*T, S*T^2*S*(T^3*S*T)^2*S, S*(T^2*S*T)^3*T^2, S*(T^2*S*T)^3*T*S, 
  ((S*T^2)^2*T)^2*T, ((S*T^2)^2*T)^2*S, S*T^2*S*(T^2*S*T^2)^2*T, S*T^2*S*(T^2*S*T^2)^2*S, S*T^2*S*(T^2*S*T)^2*T^3, S*T^2*S*(T^2*S*T)^2*T^2*S, (S*T^2)^4*T^3, (S*T^2)^4*T^2*S, 
  (T^2*S*T^4)^2*S*T, T^2*S*T^3*(T^3*S)^2*T^2, T^2*S*T^3*(T^3*S)^2*T*S, T^2*S*T^4*(T^2*S)^2*T^3, T^2*S*T^4*(T^2*S)^3, (T^2*S*T^3)^2*T*S*T^2, (T^2*S*T^3)^2*T*S*T*S, (T^2*S*T^3)^2*S*T^3, 
  (T^2*S*T^3)^2*S*T^2*S, (T^2*S*T^3)^2*S*T*S^2, T^2*S*T^3*(T^2*S)^2*T^4, T^2*S*T^3*(T^2*S)^2*T^3*S, (T^2*S*T^2)^2*T*S*T^4, (T^2*S*T^2)^2*T*S*T^3*S, (T^2*S*T^2)^2*T*S*T^2*S*T, 
  (T^2*S*T^4*S)^2, T^2*S*(T^3*S*T)^2*T*S*T, (T^2*S*T)^3*T*S*T^2, (T*S*T^2)^2*T^6*S*T, (T*S*T^2)^2*T^6*S^2, (T*S*T^2)^2*T^5*S*T^2, (T*S*T^2)^2*T^4*(T*S)^2, (T*S*T^2)^2*T^5*S^3, 
  T*S*(T^3*S*T^3)^2, (T*S*T^2)^2*T^2*(T^2*S)^2, (T*S*T^2)^2*T^3*(T*S)^2*S, T*S*(T^3*S*T^2)^2*T^2, T*S*(T^3*S*T^2)^2*T*S, T*S*(T^3*S*T^2)^2*S*T, T*S*(T^3*S*T^2)^2*S^2, 
  (T*S*T^2)^2*T^2*(T*S)^2*S^2, T*S*(T^3*S*T)^2*T^4, T*S*(T^3*S*T)^2*T^3*S, T*S*(T^3*S*T)^2*T^2*S*T, T*S*(T^3*S*T)^2*T^2*S^2, T*S*(T^3*S*T)^2*T*S*T^2, T*S*(T^3*S*T)^2*T*S^3, (T*S*T^2)^4, 
  (T*S*T^2)^3*T*S*T*S, (T*S*T^2)^3*S*T^3, (T*S*T^2)^3*S*T^2*S, (T*S*T)^2*T^2*(T^2*S)^2*T^2, (T*S*T)^2*T^2*(T^2*S)^2*T*S, T*S*(T^2*S*T^2)^2*T^4, T*S*(T^2*S*T^2)^2*T^3*S, 
  T*S*(T^2*S*T^2)^2*T^2*S*T, T*S*(T^2*S*T^2)^2*T*S*T^2, T*S*(T^2*S*T^2)^2*(T*S)^2, T*S*(T^2*S*T)^3*T^2, T*S*(T^2*S*T)^3*T*S, S*(T^2*S*T^2)^2*T*S*T^3, S*(T^2*S*T^2)^2*T*S*T^2*S, 
  S*(T^2*S*T^2)^2*S*T^2*S*T, S*(T^2*S*T)^2*T^7, S*(T^2*S*T)^2*T^6*S, S*(T^2*S*T)^2*T^5*S*T, S*T^2*S*(T^3*S*T^2)^2, S*T^2*S*(T^3*S*T)^2*T*S, S*(T^2*S*T)^3*T^3, S*(T^2*S*T)^3*T^2*S, 
  S*(T^2*S*T)^3*T*S*T, ((S*T^2)^2*T)^2*T*S, ((S*T^2)^2*T)^2*S*T, S*T^2*S*(T^2*S*T^2)^2*S*T, S*T^2*S*(T^2*S*T)^2*T^4, S*T^2*S*(T^2*S*T)^2*T^3*S, S*T^2*S*(T^2*S*T)^3, (S*T^2)^4*T^3*S, 
  (S*T^2)^4*T^2*S*T, (T^2*S*T^4)^2*S*T^2, (T^2*S*T^4)^2*S*T*S, T^2*S*T^3*(T^3*S)^2*T^3, T^2*S*T^3*(T^3*S)^2*T^2*S, T^2*S*T^4*(T^2*S)^2*T^4, T^2*S*T^4*(T^2*S)^2*T^3*S, 
  (T^2*S*T^3)^2*T*S*T^3, (T^2*S*T^3)^2*T*S*T^2*S, (T^2*S*T^3)^2*S*T^4, (T^2*S*T^3)^2*S*T^3*S, (T^2*S*T^3)^2*S*T^2*S*T, (T^2*S*T^3)^2*S*T^2*S^2, (T^2*S*T^3)^2*S*T*S^3, 
  T^2*S*T^3*(T^2*S)^2*T^5, T^2*S*T^3*(T^2*S)^2*T^4*S, (T^2*S*T^2)^2*T*S*T^5, (T^2*S*T^2)^2*T*S*T^4*S, (T^2*S*T^2)^2*T*S*T^3*S*T, (T^2*S*T^2)^2*T*S*T^2*S*T^2, (T^2*S*T^4*S)^2*T, 
  (T^2*S*T)^3*T*S*T^3, (T^2*S*T)^3*T*S*T^2*S, (T*S*T^2)^2*T^6*S*T^2, (T*S*T^2)^2*T^4*(T*S)^2*S, T*S*(T^3*S*T^3)^2*T, T*S*(T^3*S*T^3)^2*S, (T*S*T^2)^2*T^2*(T^2*S)^2*T, 
  (T*S*T^2)^2*T^2*(T^2*S)^2*S, (T*S*T^2)^2*T^3*(T*S)^2*S^2, T*S*(T^3*S*T^2)^2*T^3, T*S*(T^3*S*T^2)^2*T^2*S, T*S*(T^3*S*T^2)^2*T*S*T, T*S*(T^3*S*T^2)^2*T*S^2, T*S*(T^3*S*T^2)^2*S*T^2, 
  T*S*(T^3*S*T^2)^2*S*T*S, T*S*(T^3*S*T^2)^2*S^3, T*S*(T^3*S*T)^2*T^5, T*S*(T^3*S*T)^3, T*S*(T^3*S*T)^2*T^3*S^2, T*S*(T^3*S*T)^2*T^2*S*T^2, T*S*(T^3*S*T)^2*T*(T*S)^2, 
  T*S*(T^3*S*T)^2*T^2*S^3, T*S*(T^3*S*T)^2*T*S*T^3, T*S*(T^3*S*T)^2*T*S*T^2*S, (T*S*T^2)^4*T, (T*S*T^2)^4*S, (T*S*T^2)^3*S*T^4, T*S*T*(T^2*S*T^3*S)^2, (T*S*T)^2*T^2*(T^2*S)^3, 
  T*S*(T^2*S*T^2)^2*T^5, T*S*(T^2*S*T^2)^2*T^4*S, T*S*(T^2*S*T^2)^3, T*S*(T^2*S*T^2)^2*T*(T*S)^2, T*S*(T^2*S*T^2)^2*T*S*T^3, T*S*(T^2*S*T^2)^2*T*S*T^2*S, T*S*(T^2*S*T)^3*T^3, 
  T*S*(T^2*S*T)^3*T^2*S, S*(T^2*S*T^2)^2*T*S*T^3*S, S*(T^2*S*T^2)^2*S*T^2*S*T^2, S*(T^2*S*T^2)^2*S*T*(T*S)^2, S*(T^2*S*T)^2*T^7*S, S*(T^2*S*T)^2*T^6*S*T, S*(T^2*S*T)^2*T^5*S*T^2, 
  S*(T^2*S*T)^2*T^4*(T*S)^2, S*T^2*S*(T^3*S*T^2)^2*T, S*T^2*S*(T^3*S*T^2)^2*S, S*T^2*S*(T^3*S*T)^2*T*S*T, S*(T^2*S*T)^4, S*(T^2*S*T)^3*T*S*T^2, ((S*T^2)^2*T)^2*T*S*T, 
  ((S*T^2)^2*T)^2*S*T^2, ((S*T^2)^2*T)^2*S*T*S, S*((T^2*S)^2*T^2)^2, S*T^2*S*(T^2*S*T^2)^2*S*T*S, S*T^2*S*(T^2*S*T)^2*T^5, S*T^2*S*(T^2*S*T)^2*T^4*S, S*T^2*S*T^2*S*(T^3*S*T)^2, 
  S*T^2*S*(T^2*S*T)^3*T, S*T^2*S*(T^2*S*T)^3*S, (S*T^2)^4*T^3*S*T, (S*T^2)^4*T^2*S*T^2, (S*T^2)^4*T^2*S*T*S, (T^2*S*T^4)^2*S*T^3, (T^2*S*T^4)^2*S*T^2*S, T^2*S*T^3*(T^3*S)^2*T^4, 
  T^2*S*T^3*(T^3*S)^3, T^2*S*T^3*(T^3*S)^2*T^2*S*T, T^2*S*T^4*(T^2*S)^2*T^4*S, T^2*S*T^6*S*(T^2*S*T)^2, (T^2*S*T^3)^2*T*S*T^2*S*T, (T^2*S*T^3)^2*S*T^5, (T^2*S*T^3)^2*S*T^4*S, 
  (T^2*S*T^3)^2*S*T^3*S*T, (T^2*S*T^3)^2*S*T^3*S^2, (T^2*S*T^3)^2*S*T^2*S*T^2, (T^2*S*T^3)^2*S*T*(T*S)^2, (T^2*S*T^3)^2*S*T^2*S^3, T^2*S*T^3*(T^2*S)^2*T^6, (T^2*S*T^5*S)^2, 
  T^2*S*T^3*(T^2*S)^2*T^4*S*T, (T^2*S*T^2)^2*T*S*T^6, (T^2*S*T^2)^2*T*S*T^5*S, (T^2*S*T^4*S*T)^2, (T^2*S*T^2)^2*T*S*T^3*S*T^2, (T^2*S*T^2)^2*T*S*T^2*(T*S)^2, (T^2*S*T^2)^2*(T*S*T)^2*T*S, 
  (T^2*S*T^4*S)^2*T^2, (T^2*S*T^4*S)^2*T*S, (T^2*S*T)^3*T*S*T^4, (T*S*T^2)^2*T^6*S*T^3, (T*S*T^2)^2*T^4*(T^2*S)^2, (T*S*T^2)^2*T^4*(T*S)^2*S^2, T*S*(T^3*S*T^3)^2*S*T, 
  T*S*(T^3*S*T^3)^2*S^2, (T*S*T^2)^2*T^2*(T^2*S)^2*T^2, (T*S*T^2)^2*T^2*(T^2*S)^2*S^2, T*S*(T^3*S*T^2)^2*T^3*S, T*S*(T^3*S*T^2)^2*T^2*S*T, T*S*(T^3*S*T^2)^2*T^2*S^2, 
  T*S*(T^3*S*T^2)^2*T*S*T^2, T*S*(T^3*S*T^2)^2*(T*S)^2, T*S*(T^3*S*T^2)^2*T*S^3, T*S*(T^3*S*T^2)^2*S*T^3, T*S*(T^3*S*T^2)^2*S*T^2*S, T*S*(T^3*S*T^2)^2*S*T*S^2, T*S*(T^3*S*T)^2*T^6, 
  T*S*(T^3*S*T)^2*T^5*S, T*S*(T^3*S*T)^3*T, T*S*(T^3*S*T)^3*S, T*S*(T^3*S*T)^2*T^3*S^3, T*S*(T^3*S*T)^2*(T^2*S)^2, T*S*(T^3*S*T)^2*T*(T*S)^2*S, T*S*(T^3*S*T)^2*T*S*T^3*S, (T*S*T^2)^4*T^2,
  (T*S*T^2)^3*S*T^4*S, (T*S*T)^2*T^2*(T^2*S)^3*T, T*S*(T^2*S*T^2)^2*T^6, T*S*(T^2*S*T^2)^2*T^5*S, T*S*(T^2*S*T^2)^2*T^4*S*T, T*S*(T^2*S*T^2)^2*T*S*T^3*S, T*S*(T^2*S*T)^3*T^4, 
  T*S*(T^2*S*T)^4, S*(T^2*S*T^2)^2*T*S*T^3*S*T, S*(T^2*S*T^2)^2*(S*T^2)^2*T, S*T^2*S*T^2*(T^2*S)^4, S*(T^2*S*T)^2*T^7*S*T, S*(T^2*S*T)^2*T^6*S*T^2, S*(T^2*S*T)^2*T^5*(T*S)^2, 
  S*T^2*S*(T^3*S*T^3)^2, S*(T^2*S*T)^2*T^3*(T^2*S)^2, S*T^2*S*(T^3*S*T^2)^2*T^2, S*T^2*S*(T^3*S*T^2)^2*T*S, S*T^2*S*(T^3*S*T)^2*T*S*T^2, S*(T^2*S*T)^4*T, S*(T^2*S*T)^4*S, 
  S*(T^2*S*T)^3*T*S*T^3, S*(T^2*S*T)^3*T*S*T^2*S, ((S*T^2)^2*T)^2*T*S*T^2, ((S*T^2)^2*T)^2*T*S*T*S, ((S*T^2)^2*T)^2*S*T^3, ((S*T^2)^2*T)^2*S*T^2*S, S*((T^2*S)^2*T^2)^2*T, 
  S*((T^2*S)^2*T^2)^2*S, S*T^2*S*(T^2*S*T)^2*T^6, S*T^2*S*(T^2*S*T)^2*T^5*S, (S*T^2)^2*S*(T^3*S*T)^2*T, (S*T^2)^2*S*(T^3*S*T)^2*S, S*T^2*S*(T^2*S*T)^3*T*S, (S*T^2)^4*T^3*S*T^2, 
  (S*T^2)^4*T^2*(T*S)^2, (S*T^2)^4*T^2*S*T^3, (S*T^2)^4*T^2*S*T^2*S, (T^2*S*T^4)^2*S*T^4, (T^2*S*T^4)^2*S*T^3*S, (T^2*S*T^4)^2*S*T^2*S*T, T^2*S*T^3*(T^3*S)^2*T^4*S, T^2*S*T^3*(T^3*S)^3*T,
  T^2*S*T^3*(T^3*S)^2*T^2*S*T^2, T^2*S*T^4*(T^2*S)^2*T^4*S*T, T^2*S*T^6*S*(T^2*S*T)^2*S, (T^2*S*T^3)^2*T*S*T^2*S*T^2, (T^2*S*T^3)^2*S*T^4*S^2, (T^2*S*T^3)^2*S*T^3*S*T^2, 
  (T^2*S*T^3)^2*S*T^2*S*T^2*S, (T^2*S*T^3)^2*S*T*(T*S)^2*S, T^2*S*T^3*(T^2*S)^2*T^7, T^2*S*T^3*(T^2*S)^2*T^6*S, (T^2*S*T^5*S)^2*T, T^2*S*T^5*S*(T^2*S*T^2)^2, (T^2*S*T^2)^2*T*S*T^7, 
  (T^2*S*T^2)^2*T*S*T^6*S, (T^2*S*T^2)^2*T*S*T^5*S*T, (T^2*S*T^4*S*T)^2*T, (T^2*S*T^4*S*T)^2*S, (T^2*S*T^2)^2*T*S*T^3*S*T^3, (T^2*S*T^2)^2*T*S*T*(T^2*S)^2, (T^2*S*T)^3*T*S*T^5, 
  (T^2*S*T)^3*T*S*T^4*S, (T*S*T^2)^2*T^3*(T^3*S)^2, T*S*(T^3*S*T^3)^2*S*T^2, T*S*(T^3*S*T^3)^2*S*T*S, T*S*(T^3*S*T^3)^2*S^3, (T*S*T^2)^2*T^2*(T^2*S)^2*T^3, (T*S*T^2)^2*T^2*(T^2*S)^3, 
  T*S*(T^3*S*T^2)^2*T^3*S*T, T*S*(T^3*S*T^2)^2*T^3*S^2, T*S*(T^3*S*T^2)^2*T^2*S*T^2, T*S*(T^3*S*T^2)^2*T*(T*S)^2, T*S*(T^3*S*T^2)^2*T^2*S^3, T*S*(T^3*S*T^2)^2*T*S*T^2*S, 
  T*S*(T^3*S*T^2)^2*(T*S)^2*S, T*S*(T^3*S*T^2)^2*S*T^4, T*S*(T^3*S*T^2)^2*S*T^3*S, T*S*(T^3*S*T^2)^2*S*T^2*S*T, T*S*(T^3*S*T^2)^2*S*T^2*S^2, T*S*(T^3*S*T^2)^2*S*T*S^3, 
  T*S*(T^3*S*T)^2*T^6*S, T*S*(T^3*S*T)^3*T^2, T*S*(T^3*S*T)^3*T*S, T*S*(T^3*S*T)^3*S^2, T*S*(T^3*S*T)^2*(T^2*S)^2*T, T*S*(T^3*S*T)^2*(T^2*S)^2*S, T*S*(T^3*S*T)^2*T*(T*S)^2*S^2, 
  (T*S*T^2)^4*T^3, (T*S*T^2)^4*T^2*S, (T*S*T^2)^3*S*T^4*S*T, (T*S*T)^2*T^2*(T^2*S)^3*T^2, (T*S*T)^2*T^2*(T^2*S)^3*T*S, T*S*(T^2*S*T^2)^2*T^6*S, T*S*(T^2*S*T^2)^2*T^5*S*T, 
  T*S*T^2*S*(T^4*S*T^2)^2, T*S*(T^2*S*T^2)^2*T^3*(T*S)^2, T*S*(T^2*S*T^2)^2*T*S*T^3*S*T, T*S*(T^2*S*T)^3*T^5, T*S*(T^2*S*T)^3*T^4*S, T*S*(T^2*S*T)^4*T, S*(T^2*S*T^2)^2*T*S*T^3*S*T^2, 
  S*(T^2*S*T^2)^2*T*S*T^2*(T*S)^2, S*(T^2*S*T^2)^2*(S*T^2)^2*T^2, S*(T^2*S*T^2)^2*(S*T^2)^2*T*S, S*(T^2*S*T)^2*T^7*S*T^2, S*(T^2*S*T)^2*T^3*(T^2*S)^2*T, S*T^2*S*(T^3*S*T^2)^2*T^2*S, 
  S*T^2*S*(T^3*S*T)^2*T*S*T^3, S*T^2*S*(T^3*S*T)^2*T*S*T^2*S, S*(T^2*S*T)^4*T^2, S*(T^2*S*T)^4*T*S, S*(T^2*S*T)^3*T*S*T^4, S*T^2*S*T*(T^2*S*T^3*S)^2, ((S*T^2)^2*T)^2*T*S*T^3, 
  ((S*T^2)^2*T)^2*T*S*T^2*S, ((S*T^2)^2*T)^2*S*T^4, ((S*T^2)^2*T)^2*S*T^3*S, ((S*T^2)^2*T)^2*S*T^2*S*T, S*((T^2*S)^2*T^2)^2*T^2, S*((T^2*S)^2*T^2)^2*T*S, S*((T^2*S)^2*T^2)^2*S*T, 
  S*T^2*S*(T^2*S*T)^2*T^5*S*T, (S*T^2)^2*S*(T^3*S*T)^2*T^2, (S*T^2)^2*S*(T^3*S*T)^2*T*S, (S*T^2)^4*T^3*S*T^3, (S*T^2)^4*T^3*S*T^2*S, (S*T^2)^4*T^2*S*T^4, (S*T^2)^4*T^2*S*T^3*S, 
  (T^2*S*T^4)^2*S*T^3*S*T, (T^2*S*T^4)^2*S*T^2*S*T^2, T^2*S*T^6*S*(T^3*S*T)^2, T^2*S*T^3*(T^3*S)^2*(T^2*S)^2, (T^2*S*T^3)^2*(T*S*T)^2*T^2, (T^2*S*T^3)^2*(S*T^2)^2*S^2, 
  T^2*S*T^3*(T^2*S)^2*T^6*S*T, (T^2*S*T^5*S)^2*T^2, (T^2*S*T^5*S)^2*T*S, T^2*S*T^5*S*(T^2*S*T^2)^2*T, T^2*S*T*(T^2*(T^2*S)^2)^2, (T^2*S*T^2)^2*T*S*T^6*S*T, T^2*S*T^4*S*(T^3*S*T^2)^2, 
  (T^2*S*T^2)^2*(T*S*T^2)^2*T^2, T^2*S*T*(T^3*S)^4, (T^2*S*T)^3*T*S*T^6, T*S*(T^3*S*T^3)^2*S*T^3, T*S*(T^3*S*T^3)^2*S*T^2*S, T*S*(T^3*S*T^3)^2*S*T*S^2, (T*S*T^2)^2*T^2*(T^2*S)^2*T^4, 
  (T*S*T^2)^2*T^2*(T^2*S)^2*T^3*S, T*S*(T^3*S*T^2)^3, T*S*(T^3*S*T^2)^2*T^2*(T*S)^2, T*S*(T^3*S*T^2)^2*T^2*S*T^3, T*S*(T^3*S*T^2)^2*(T^2*S)^2, T*S*(T^3*S*T^2)^2*T*(T*S)^2*S, 
  T*S*(T^3*S*T^2)^2*(T*S*T)^2, T*S*(T^3*S*T^2)^2*T*S*T^2*S^2, T*S*(T^3*S*T^2)^2*(T*S)^2*S^2, T*S*(T^3*S*T^2)^2*S*T^4*S, T*S*(T^3*S*T^2)^2*S*T^3*S^2, T*S*(T^3*S*T^2)^2*(S*T^2)^2, 
  T*S*(T^3*S*T)^3*T*S*T, T*S*(T^3*S*T)^3*T*S^2, T*S*(T^3*S*T)^3*S^3, T*S*(T^3*S*T)^2*(T^2*S)^2*T^2, T*S*(T^3*S*T)^2*(T^2*S)^2*T*S, (T*S*T^2)^4*T^4, (T*S*T^2)^4*T^3*S, 
  (T*S*T^2)^2*T*S*(T^2*S*T^2)^2, (T*S*T)^2*T^2*(T^2*S)^3*T^3, (T*S*T)^2*T^2*(T^2*S)^4, T*S*T^2*S*(T^4*S*T^2)^2*S, T*S*(T^2*S*T^2)^2*(T*S*T^2)^2, T*S*(T^2*S*T^2)^2*T*S*T^2*(T*S)^2, 
  T*S*(T^2*S*T)^3*T^6, T*S*(T^2*S*T)^4*T*S, S*(T^2*S*T^2)^2*S*(T^2*S*T)^2, S*(T^2*S*T)^2*T^7*S*T^3, S*(T^2*S*T)^2*T^3*(T^2*S)^2*T^2, S*T^2*S*(T^3*S*T^2)^2*T^2*S*T, S*(T^2*S*T)^4*T*S*T, 
  S*(T^2*S*T)^3*T*S*T^4*S, S*T^2*S*T*(T^2*S*T^3*S)^2*T, S*T^2*S*(T*(T^2*S)^2*T)^2, ((S*T^2)^2*T)^2*S*T^3*S*T, S*((T^2*S)^2*T^2)^2*T*S*T, S*T^2*S*(T^2*S*T)^2*T^5*S*T^2, 
  (S*T^2)^2*S*(T^3*S*T)^2*T^2*S, T^2*S*T^3*(T^2*S)^2*T^6*S*T^2, T^2*S*T^5*S*(T^2*S*T^2)^2*T^2, T^2*S*T^5*S*(T^2*S*T^2)^2*T*S, (T^2*S*T^2)^2*T*S*T^5*(T*S)^2, T^2*S*T*(T^3*S)^4*T, 
  T*S*(T^3*S*T^3)^2*S*T^2*S*T, T*S*(T^3*S*T^3)^2*S*T^2*S^2, T*S*(T^3*S*T^3)^2*S*T*S^3, (T*S*T^2)^2*T^2*(T^2*S)^2*T^4*S, (T*S*T^2)^2*T^4*S*(T^2*S*T)^2, T*S*(T^3*S*T^2)^3*T, 
  T*S*(T^3*S*T^2)^3*S, T*S*(T^3*S*T^2)^2*T^2*S*T^3*S, T*S*(T^3*S*T^2)^2*(T^2*S)^2*T, T*S*(T^3*S*T^2)^2*(T^2*S)^2*S, T*S*(T^3*S*T^2)^2*T*(T*S)^2*S^2, T*S*(T^3*S*T^2)^2*(T*S*T)^2*T, 
  T*S*(T^3*S*T^2)^2*S*T^4*S*T, T*S*(T^3*S*T^2)^2*S*T^4*S^2, T*S*(T^3*S*T^2)^2*S*T^3*S^3, T*S*(T^3*S*T)^3*T*S*T^2, T*S*(T^3*S*T)^3*T*S^3, T*S*(T^3*S*T)^2*(T^2*S)^3, (T*S*T^2)^4*T^5, 
  (T*S*T^2)^4*T^4*S, T*S*(T^2*S*T^2)^2*(T*S*T^2)^2*T, T*S*(T^2*S*T^2)^2*(T*S*T^2)^2*S, S*(T^2*S*T^2)^2*S*(T^2*S*T)^2*S, S*(T^2*S*T)^2*T^4*(T^3*S)^2, S*(T^2*S*T)^2*T^3*(T^2*S)^2*T^3, 
  S*(T^2*S*T)^4*T*S*T^2, S*(T^2*S*T)^3*T*S*T^4*S*T, S*T^2*S*T*(T^2*S*T^3*S)^2*T^2, S*T^2*S*(T*(T^2*S)^2*T)^2*T, ((S*T^2)^2*T)^2*S*T^3*S*T^2, ((S*T^2)^2*T)^2*S*T^2*(T*S)^2, 
  S*((T^2*S)^2*T^2)^2*T*S*T^2, S*T^2*S*T^2*S*(T^3*S*T^3)^2, (S*T^2)^2*S*(T^3*S*T)^2*T^2*S*T, T*S*(T^3*S*T^3)^2*(S*T^2)^2, T*S*(T^3*S*T^3)^2*S*T^2*S^3, (T*S*T^2)^2*T^2*(T^2*S)^2*T^4*S*T, 
  T*S*(T^3*S*T^2)^3*S*T, T*S*(T^3*S*T^2)^2*(T^2*S*T)^2, T*S*(T^3*S*T^2)^2*T^2*S*T^3*S^2, T*S*(T^3*S*T^2)^2*(T^2*S)^2*S^2, T*S*(T^3*S*T^2)^2*S*T^3*(T*S)^2, T*S*(T^3*S*T)^3*T*S*T^3, 
  S*(T^2*S*T)^4*T*S*T^3, S*(T^2*S*T)^4*T*S*T^2*S, S*(T^2*S*T)^2*T^2*S*(T^2*S*T^2)^2, S*(T^2*S*T)^3*T*S*T^3*(T*S)^2, S*T^2*S*T*(T^2*S*T^3*S)^2*T^2*S, S*T^2*S*(T*(T^2*S)^2*T)^2*T*S ]

gap> STOP_TEST( "veechgroup.tst" );

