Read("testfiles/simultanconjugated.g");

gap> O := Origami((1,2,4,3), (), 4);
Origami((1,2,4,3), (), 4)
gap> IsSameVeechGroupForTestfile(SAction(VeechGroup(O)), TAction(VeechGroup(O)), (1,3)(2,5)(4,6), (1,2,4,5));
true
gap> #The Eilerlegende Wollmilchsau
gap> O := Origami((1,2,3,4)(5,6,7,8), (1,8,3,6)(2,7,4,5), 8);
Origami((1,2,3,4)(5,6,7,8), (1,8,3,6)(2,7,4,5), 8)
gap> SAction(VeechGroup(O));
()
gap> TAction(VeechGroup(O));
()
gap> O := Origami((1,2,4,3,6)(5,7), (1,6,3)(2,7)(4,5), 7);
Origami((1,2,4,3,6)(5,7), (1,6,3)(2,7)(4,5), 7)
gap> IsSameVeechGroupForTestfile(SAction(VeechGroup(O)), TAction(VeechGroup(O)), (1,2)(3,7)(4,9)(5,11)(6,13)(8,16)(10,19)(12,21)(14,23)(15,25)(17,27)(18,29)(20,31)(22,34)(24,37)(26,39)(28,42)(30,44)(32,47)(33,48)(35,50)(36,52)(38,55)(40,57)(41,59)(43,62)(45,64)(46,65)(49,69)(51,
> 72)(53,74)(54,76)(56,79)(58,81)(60,84)(61,85)(63,88)(66,92)(67,87)(68,90)(70,97)(71,99)(73,102)(75,104)(77,107)(78,101)(80,109)(82,105)(83,112)(86,115)(89,116)(91,117)(93,120)(94,100)(95,121)(96,
> 122)(98,125)(103,127)(106,129)(108,113)(110,124)(111,132)(114,133)(118,135)(119,128)(123,137)(126,130)(131,138)(134,141)(136,139)(140,143)(142,144), (1,3,8,17,28,43,32,20,10,4)(2,5,12,22,35,51,38,24,14,6)(7,13,15)(9,18,11)(16,25,23,36,53,75,105,111,82,58,40,26)(19,30,45,33,21,29)(27,39,56,60,41)(31,46,66,93,89,63,44)(34,48,68,
> 95,98,70,49)(37,54,77,73,52)(42,59,83,90,64,88,106,76,55,78,86,61)(47,67,94,118,91,65)(50,69,96,123,100,71)(57,80,110,125,108,79)(62,85,114,101,72,99,87)(74,102,126,120,128,103)(81,104,127,139,140,131,
> 109)(84,113,121,112)(92,117,134,122,97,124,138,142,136,119)(107,129,116,130)(115,133)(135,137,141)(143,144));
true
gap> O := Origami((1,6)(2,5,4), (1,3,2,4,5), 6);
Origami((1,6)(2,5,4), (1,3,2,4,5), 6)
gap> IsSameVeechGroupForTestfile(SAction(VeechGroup(O)), TAction(VeechGroup(O)), (1,2,6,3)(4,11,17,12)(5,14,18,15)(7,19,9,20)(8,22,10,23)(13,29,36,30)(16,34,37,35)(21,40,25,41)(24,43,26,44)(27,46,28,47)(31,50,58,51)(32,52,33,53)(38,59,39,60)(42,63,45,64)(48,67,49,68)(54,75,55,
> 76)(56,71,57,72)(61,79,62,80)(65,83,66,84)(69,87,70,88)(73,91,74,92)(77,93,78,94)(81,99,82,100)(85,101,86,102)(89,105,90,106)(95,109,96,110)(97,103,98,104)(107,117,108,118)(111,120,112,119)(113,115,
> 114,116), (1,4,13,31,16,5)(2,7,21,42,24,8)(3,9,25,45,26,10)(6,17,36,58,37,18)(11,23,27)(12,22,28)(14,32,54,38,19)(15,33,55,39,20)(29,47,43,65,69,48)(30,46,44,66,70,49)(34,56,73,52)(35,57,74,53)(40,60,78,
> 96,81,61)(41,59,77,95,82,62)(50,68,86,89,71)(51,67,85,90,72)(63,80,98,83)(64,79,97,84)(75,92,105,115,107,93)(76,91,106,116,108,94)(87,103,99,111,113,101)(88,104,100,112,114,102)(109,118,119)(110,117,
> 120));
true
gap> quit;
